//
//  Questions.swift
//  36Questions
//
//  Created by LeeMinJi on 2023/02/26.
//

import Foundation

let sets = [firstSet, secondSet, thirdSet]

let firstSet: [String] = [
    "세계의 누구든 초대할 수 있다면,\n당신은 누굴 저녁 식사에 초대하고 싶은가요",
    "당신은 유명해지기를 원합니까?\n원한다면 어떤 방법으로 유명해지고 싶나요?",
    "당신은 전화를 걸기 전에 상대에게 이야기 할 것을 미리 연습하나요?\n그 이유는 무엇인가요?",
    "당신에게 완벽한 날이 되기 위해 어떤 게 필요한가요",
    "가장 최근에 당신 자신을 위해 노래를 부른 게 언제였나요?\n다른 사람을 위해 노래를 부른 적은 언제인가요?",
    "당신이 90세까지 살 수 있고, \n앞으로 60년 동안 몸과 마음 중 하나는 30세로 유지할 수 있다면, \n당신은 몸과 마음 중 어느 것을 선택합니까?",
    "당신과 내가 공유하고 있는 것을 세 가지만 이야기 해보세요.",
    "당신 삶에서 가장 감사하다고 느끼고 있는 것은 무엇인가요?",
    "당신이 성장한 방식 중에서 바꾸고 싶은 게 있다면 무엇인가요?",
    "3분 동안 당신의 삶에 대해 가능한 한 자세히 이야기 해보세요.",
    "당신이 내일 어떤 하나의 자질이나 능력을 갖고 깨어난다면 그것은 무엇일까요?"
    ]
    
let secondSet: [String] = [
    "수정 구슬이 당신 자신, 삶, 미래에 대해 알려준다면 당신은 무엇을 알고 싶나요",
    "당신이 오랫동안 해보고 싶은 꿈이 있나요?\n있다면 왜 그것을 하지 않았나요?",
    "당신 삶에서 가장 큰 업적은 무엇입니까?",
    "당신이 우정에서 가장 가치 있게 여기는 것은 무엇인가요?",
    "당신의 가장 소중한 기억은 무엇인가요?",
    "당신이 1년 내에 갑자기 죽는다는 것을 알게 된다면,\n당신은 지금 살고 있는 방식 중에서 무엇을 바꾸고 싶은가요?\n그리고 그 이유는 무엇인가요?",
    "당신에게 우정은 어떤 의미인가요?",
    "사랑과 애정이 당신 삶에서 어떤 역할을 하나요?",
    "나의 긍정적인 성격을 5개 말해보세요."
    ]

let thirdSet: [String] = [
    "\"우리\"로 시작되는 문장을 3개 말해보세요.\n예를 들어 \"우리는 둘 다 ~~한 느낌을 가지고 있다\"와 같은 문장입니다.",
    "다음 문장을 완성해보세요.\n\"나는 ~~을 함께 나눌 누군가가 있었으면 좋겠다.\"",
    "내가 당신과 가까운 친구가 되기 위해 당신에 대해 알아야 하는 것을 말해보세요.",
    "내가 어떤 점이 마음에 드는 지 솔직하게 말해보세요.\n(처음 만난 사람에게는 하지 않을 이야기라도 말해야 한다는 뜻이죠.)",
    "당신의 삶에서 당황스러웠던 순간을 이야기해보세요.",
    "가장 최근에 다른 사람 앞에서 울었던 적이 언제인가요?\n혼자 운 적이 있나요?",
    "나에 대해 이미 좋아하게 된 것들을 말해보세요.",
    "혹시 농담으로라도 말해서는 안 되는 것이 있다면 어떤 것들이 있을까요",
    "오늘 밤 누구와도 연락하지 못한 상태에서 죽게 된다며,\n그 말을 하지 못한 것을 가장 후회할 사람이 있나요?\n왜 아직까지 그 말을 하지 못했나요?",
    "당신의 모든 것이 있는 집이 불에 타고 있습니다.\n가족들을 다 구한 뒤 마지막 한 가지를 가지고 나올 수 있습니다.\n무엇을 가지고 나올 건가요?",
]
